app/controllers/products_controller.rb

  def create
  	@product = current_user.products.build(product_params)
  	if @product.save
---
INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aaa"], ["description", "bbb"], ["price", 1111], ["created_at", "2018-11-25 11:58:21.174703"], ["updated_at", "2018-11-25 11:58:21.174703"], ["user_id", 2]]

  def show
  	@product = Product.find_by(id:params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]